7Ji/esp8266-temp-monitor-and-pc-reset/src/main.cpp
static NtpSyncer ntpSyncer = {};

struct SensorRecord {
  COMPCONST int const lenBuffer = 38; /* extreme 18446744073709551615,255.255,255.255\n */
  COMPCONST int const lenBufferShort = 16; /* extreme 255.255,255.255\0 */

  uint32_t timestamp; /* second */
  int8_t tempInt;
  uint8_t tempDot;
  uint8_t humidInt;
  uint8_t humidDot;

  /* buffer should be at least lenBuffer */
  bool intoStr(uint64_t const unixOffset, char *const buffer, size_t &len) const {
    int const r = snprintf(buffer, lenBuffer, "%" PRIu64 ",%" PRId8 ".%" PRIu8 ",%" PRIu8 ".%" PRIu8 "\n", unixOffset + timestamp, tempInt, tempDot, humidInt, humidDot);

    if (r < 0) {
      serverSendError(StringFormatFailure);
      return false;
    } else if (r >= lenBuffer) {
      serverSendError(StringWouldTruncate);
      return false;
    } else {
      len = r;
      return true;
    }
  }
};

static_assert(sizeof(struct SensorRecord) == 8, "SensorRecord should have a size of 4");

struct SensorSlice {
  COMPCONST uint32_t const Magic = 0x82660C05;
  COMPCONST uint16_t const MaxRecords = 30;
  COMPCONST uint16_t const MaxRecordsSub1 = MaxRecords - 1;
  COMPCONST uint16_t const CountChecksum32 = (MaxRecords + 1) * 2;
  COMPCONST uint16_t const CountAll32 = MaxRecords + 2;

  uint32_t magic = Magic;
  uint32_t checksum;
  uint64_t unixOffset;
  SensorRecord records[MaxRecords];

  uint32_t actualChecksum() const {
    uint32_t const *const raw = reinterpret_cast<uint32_t const *>(&unixOffset);
    uint32_t x = *raw;
    uint16_t i;
    for (i = 1; i < CountChecksum32; ++i) {
      x ^= raw[i];
    }
    return x;
  }

  void shift() {
    uint16_t recordID, recordIDNext;

    for (recordID = 0; recordID < MaxRecordsSub1;) {
      recordIDNext = recordID + 1;
      records[recordID] = records[recordIDNext];
      recordID = recordIDNext;
    }
  }

  bool valid() {
    uint32_t expectedChecksum;

    if (magic != SensorSlice::Magic) {
      Serial.printf("Slice magic not right (recorded %08" PRIx32 " != expected %08" PRIx32 ")\n", magic, SensorSlice::Magic);
      return false;
    }
    expectedChecksum = actualChecksum();
    if (checksum != expectedChecksum) {
      Serial.printf("Slice Checksum mismatch (recorded %08" PRIx32 " != expected %08" PRIx32")\n", checksum, expectedChecksum);
      return false;
    }
    return true;
  }
};

struct SensorHistory {
  COMPCONST uint32_t const MinInterval = 2000;
  COMPCONST uint8_t const MaxHistoryL0 = 1 << 5; /* 2s * 32, even secondly, for about a minute */

  COMPCONST uint8_t const RingMaskL0 = MaxHistoryL0 - 1;

  COMPCONST uint32_t const FlashAddrStart = 0x100000;
  COMPCONST uint32_t const FlashAddrEnd = 0x3FB000;
  COMPCONST int const FlashSectExp = 12;
  COMPCONST uint16_t const FlashSectSize = 1 << FlashSectExp; /* 4096 */
  COMPCONST uint16_t const FlashSectStart = FlashAddrStart / FlashSectSize;
  COMPCONST uint16_t const FlashSectEnd = FlashAddrEnd / FlashSectSize;
  COMPCONST uint16_t const FlashSectTotal = FlashSectEnd - FlashSectStart;
  COMPCONST int const FlashPageExp = 8;
  COMPCONST int const FlashSectPageFactor = FlashSectExp - FlashPageExp;
  COMPCONST uint8_t const FlashSectPageCount = 1 << FlashSectPageFactor;
  COMPCONST uint16_t const FlashSectWordCount = FlashSectSize / sizeof(uint32_t);
  COMPCONST uint16_t const FlashPageSize = 1 << FlashPageExp; /* 256 */
  static_assert(sizeof(struct SensorSlice) == FlashPageSize, "SensorSlice should have the same size as page");
  COMPCONST uint16_t const FlashPageInSectMask = FlashSectPageCount - 1;
  COMPCONST uint16_t const FlashPageStart = FlashAddrStart / FlashPageSize;
  COMPCONST uint16_t const FlashPageEnd = FlashAddrEnd / FlashPageSize;
  COMPCONST uint16_t const FlashPageTotal = FlashPageEnd - FlashPageStart;
  COMPCONST uint16_t const FlashPageTotalSubSect = FlashPageTotal - FlashSectPageCount;
  COMPCONST uint8_t const FlashPageWordCount = FlashPageSize / sizeof(uint32_t);

  union {
    SensorSlice sliceL1 = {.magic = SensorSlice::Magic};
    uint32_t sliceL1Raw[sizeof(SensorSlice) / sizeof(uint32_t)];
  };
  union {
    SensorSlice sliceL2; /* about minutely, flush to flash every 30 minutes */
    uint32_t sliceL2Raw[sizeof(SensorSlice) / sizeof(uint32_t)];
  };
  SensorRecord recordsL0[MaxHistoryL0];
  uint32_t millisLast = 0;
  uint16_t countL2 = 0; /* page */
  uint16_t headL2 = 0; /* sector */
  uint16_t countL1 = 0;
  uint8_t headL0 = 0;
  uint8_t countL0 = 0;

  uint16_t firstPage() const {
    return headL2 << FlashSectPageFactor;
  }

  uint16_t slicePage(uint16_t const sliceID) const {
    return (firstPage() + sliceID) % FlashPageTotal;
  }

  SensorRecord &first() {
    if (countL2 > 0 && fetchPage(firstPage())) {
      return sliceL2.records[0];
    } else if (countL1 > 0) {
      return sliceL1.records[0];
    } else {
      return recordsL0[headL0];
    }
  }

  SensorRecord &last() {
    return recordsL0[(headL0 + countL0 - 1) & RingMaskL0];
  }

  bool erase(uint16_t const sectorID) {
    uint16_t const flashSectorID = sectorID + FlashSectStart;
    SpiFlashOpResult opResult;

    Serial.printf("Erasing sector %" PRIu16 "/f%" PRIu16 "\n", sectorID, flashSectorID);
    opResult = spi_flash_erase_sector(flashSectorID);
    if (opResult != SPI_FLASH_RESULT_OK) {
      Serial.printf("Failed to erase sector %" PRIu16 "/f%" PRIu16 ", op result %d\n", sectorID, flashSectorID, opResult);
      return false;
    }
    return true;
  }

  bool writeL1(uint16_t const pageID) {
    uint16_t const flashPageID = pageID + FlashPageStart;
    SpiFlashOpResult opResult;

    Serial.printf("Writing L1 to page %" PRIu16 "/f%" PRIu16 "\n", pageID, flashPageID);
    opResult = spi_flash_write(flashPageID * FlashPageSize, sliceL1Raw, FlashPageSize);
    if (opResult != SPI_FLASH_RESULT_OK) {
      Serial.printf("Failed to write L1 to page %" PRIu16 "/f%" PRIu16 ", op result %d\n", pageID, flashPageID, opResult);
      return false;
    }
    return true;
  }

  void fallbackShift() {
    Serial.println("Falling back to shift L1 by one position");
    sliceL1.shift();
    countL1 = SensorSlice::MaxRecordsSub1;
  }

  void flushL1L2() {
    uint16_t const pageID = slicePage(countL2);
    bool const afterBoundary = pageID & FlashPageInSectMask;

    Serial.printf("Flushing L1 to L2 flash page %" PRIu16 "\n", pageID);

    if (!afterBoundary) {
      /* Whether we successfully erase the sector or not, consider pages on it bad */
      if (countL2 > FlashPageTotalSubSect) { /* Technically this could only be countL2 == FlashPageTotal, but do this securely */
        headL2 = (headL2 + 1) % FlashSectTotal;
        countL2 = FlashPageTotalSubSect;
      }
      if (!erase(pageID >> FlashSectPageFactor)) {
        fallbackShift();
        return;
      }
    }
    sliceL1.unixOffset = ntpSyncer.unixOffset;
    sliceL1.checksum = sliceL1.actualChecksum();
    if (!writeL1(pageID)) {
      fallbackShift();
      return;
    }
    countL1 = 0;
    ++countL2;
  }

  bool erasedL2() {
    uint16_t wordID;

    for (wordID = 0; wordID < SensorSlice::CountAll32; ++ wordID) {
      if (sliceL2Raw[wordID] != UINT32_MAX) {
        return false;
      }
    }
    return true;
  }

  bool fetchFlashPage(uint16_t const flashPageID) {
    SpiFlashOpResult opResult;

    opResult = spi_flash_read(flashPageID * FlashPageSize, sliceL2Raw, FlashPageSize);

    if (opResult != SPI_FLASH_RESULT_OK) {
      Serial.printf("fetch f%" PRIu16 ": Read not OK, op result %d\n", flashPageID, opResult);
      return false;
    }
    return sliceL2.valid();
  }

  bool fetchPage(uint16_t const pageID) {
    return fetchFlashPage(pageID + FlashPageStart);
  }

  void recoverFlash() {
    uint16_t sectorID, flashSectorID, sectorPageID, flashPageID, pageCount = 0, firstPageCount = 0, secondSectHead = 0;
    uint64_t unixLast = 0, unixLastSector = 0, unixThis, unixFirst = 0;
    SpiFlashOpResult opResult;
    bool first = true, seenEmptyPage;

    Serial.println("Recovering on-flash records...");
    for (
      sectorID = 0,
      flashSectorID = FlashSectStart;

