7Ji/esp8266-temp-monitor-and-pc-reset/src/main.cpp
      sectorID < FlashSectTotal;

      ++sectorID,
      ++flashSectorID
    ) {
      for (
        sectorPageID = 0,
        flashPageID = flashSectorID << FlashSectPageFactor,
        seenEmptyPage = false;

        sectorPageID < FlashSectPageCount;

        ++sectorPageID,
        ++flashPageID
      ) {
        opResult = spi_flash_read(flashPageID << FlashPageExp, sliceL2Raw, FlashPageSize);
        if (opResult != SPI_FLASH_RESULT_OK) {
          Serial.printf("Failed to read sector %" PRIu16 "/f%" PRIu16 " page %" PRIu16 "/f%" PRIu16 " when recovering, using good pages before it\n", sectorID, flashSectorID, sectorPageID, flashPageID);
          headL2 = 0;
          countL2 = firstPageCount;
          return;
        }
        if (erasedL2()) { /* Empty page */
          if (secondSectHead > 0) {
            Serial.printf("Page %" PRIu16 " in sector %" PRIu16 "/f%" PRIu16 " is empty, when we expect second head; use only the first half of ring\n", sectorPageID, sectorID, flashSectorID);
            headL2 = 0;
            countL2 = firstPageCount;
            return;
          }
          seenEmptyPage = true;
          continue;
        }
        if (seenEmptyPage || !sliceL2.valid()) {
          if (seenEmptyPage) {
            Serial.println("Non-empty page after empty page in same sector");
          }
          Serial.printf("Page %" PRIu16 " in sector %" PRIu16 "/f%" PRIu16 " is bad; ", sectorPageID, sectorID, flashSectorID);
          if (secondSectHead > 0) {
            Serial.printf("and we were expecting second half of ring after either alike sector or empty sector, using sectors before %" PRIu16 "\n", secondSectHead);
            headL2 = 0;
            countL2 = firstPageCount;
            return;
          } else {
            Serial.println("consider this sector bad and expect next sector to be head of second part of ring");
            firstPageCount = sectorID << FlashSectPageFactor;
            secondSectHead = sectorID + 1;
            unixLast = unixLastSector;
            break;
          }
        }
        unixThis = sliceL2.unixOffset + sliceL2.records[0].timestamp;
        if (first) { /* avoid bool(uint64_t) which needs software emulation */
          unixFirst = unixThis;
          first = false;
        }
        if (unixThis <= unixLast) { /* Jumping back, allowed only once, and only for the first page in sector */
          if (secondSectHead > 0 && (sectorID != secondSectHead || sectorPageID > 0)) {
            /* After a partial/bad sector, a jump back is only valid at the expected second head. */
            Serial.printf("Flash page %" PRIu16 " in sector %" PRIu16 "/f%" PRIu16 " jump back when we already expects second half sectors head at sector %" PRIu16 ", use pages before it\n", sectorPageID, sectorID, flashSectorID, secondSectHead);
            headL2 = 0;
            countL2 = firstPageCount;
            return;
          } else if (sectorPageID > 0) { /* not the first page, not allowed */
            Serial.printf("Flash page %" PRIu16 " in sector %" PRIu16 "/f%" PRIu16 " jump back but it's not the first page, consider this sector bad, expect next sector to be head of second\n", sectorPageID, sectorID, flashSectorID);
            firstPageCount = sectorID << FlashSectPageFactor;
            secondSectHead = sectorID + 1;
            unixLast = unixLastSector;
            break;
          } else { /* jumping back at first page, first time */
            firstPageCount = sectorID << FlashSectPageFactor;
            secondSectHead = sectorID;
          }
        } else if (!secondSectHead) {
          ++firstPageCount;
        }
        ++pageCount;
        unixLast = unixThis;
      }
      /* The above logic should guarantee when seenEmptyPage == true, secondSecHead == false, but do a check anyway */
      if (seenEmptyPage && !secondSectHead) {
        secondSectHead = sectorID + 1;
      }
      if (sectorPageID == FlashSectPageCount) {
        unixLastSector = unixLast;
      }
    }
    if (secondSectHead > 0 && unixFirst <= unixLast) {
      Serial.printf("Flash jumped back at sector %" PRIu16 " yet the first unix offset %" PRIu64 " is not larger than last offset %" PRIu64 ", use pages before jumping back\n", secondSectHead, unixFirst, unixLast);
      headL2 = 0;
      countL2 = firstPageCount;
    } else {
      headL2 = secondSectHead;
      countL2 = pageCount;
    }
  }

  void fetchAppend(uint32_t const millisCurrent) {
    struct SensorRecord * record;
    uint16_t current;

    if (!dht.read(true)) {
      return;
    }

    if (countL0 == MaxHistoryL0) {
      if (!headL0) {
        if (countL1 == SensorSlice::MaxRecords) {
          flushL1L2();
        }
        sliceL1.records[countL1++] = recordsL0[0];
      }
      current = headL0;
      headL0 = (headL0 + 1) & RingMaskL0;
    } else {
      current = (headL0 + countL0++) & RingMaskL0;
    }

    record = recordsL0 + current;

    millisLast = millisCurrent;
    record->timestamp = upTimer.upSeconds(millisCurrent);
    record->humidInt = dht.data[0];
    record->humidDot = dht.data[1];
    record->tempInt =  static_cast<int8_t>(dht.data[2]);
    record->tempDot = dht.data[3];
  }

  void firstFetchAppend(uint32_t const millisCurrent) {
    dht.begin();
    fetchAppend(millisCurrent);
  }

  void maybeFetchAppend(uint32_t const millisCurrent) {
    if (millisCurrent - millisLast >= MinInterval) {
      fetchAppend(millisCurrent);
    }
  }
};

static SensorHistory history = {};

void httpHandleLast() {
  int i, r, offset, remain;
  int const countArgs = server.args();
  SensorRecord &record = history.last();
  char buffer[SensorRecord::lenBufferShort];

  if (countArgs > 0) {
    offset = 0, remain = SensorRecord::lenBufferShort;
    buffer[1] = '\0';
    for (i = 0; i < countArgs; ++i) {
      String const &argName = server.argName(i);
      if (argName.startsWith("temp")) {
        r = snprintf(buffer + offset, remain, ",%" PRId8 ".%" PRIu8, record.tempInt, record.tempDot);
      } else if (argName.startsWith("humid")) {
        r = snprintf(buffer + offset, remain, ",%" PRIu8 ".%" PRIu8, record.humidInt, record.humidDot);
      } else {
        continue;
      }
      if (r < 0) {
        serverSendError(StringFormatFailure);
        return;
      }
      if (r >= remain) {
        serverSendError(StringWouldTruncate);
        return;
      }
      offset += r;
      remain -= r;
    }
    server.send(200, "text/plain", buffer + 1, offset - 1);
  } else {
    r = snprintf(buffer, SensorRecord::lenBufferShort, "%" PRId8 ".%" PRIu8 ",%" PRIu8 ".%" PRIu8 "", record.tempInt, record.tempDot, record.humidInt, record.humidDot);
    if (r < 0) {
      serverSendError(StringFormatFailure);
      return;
    }
    if (r >= SensorRecord::lenBufferShort) {
      serverSendError(StringWouldTruncate);
    }
    server.send(200, "text/plain", buffer, r);
  }
}

