7Ji/esp8266-temp-monitor-and-pc-reset/src/main.cpp
void httpHandleNotFound() {
  server.send_P(404, "text/plain", ErrorNotFound, sizeof(ErrorNotFound) - 1);
}

bool serverIsAuthorized() {
  static String const AuthExpected = String("Bearer " PRIVATE_PC_AUTH);
  static String const HeaderAuthorization = String("Authorization");

  if (!server.hasHeader(HeaderAuthorization)) {
    return false;
  }

  return server.header(HeaderAuthorization) == AuthExpected;
}

void pulseButton(uint8_t const pin) {
  digitalWrite(pin, HIGH);
  delay(250);
  digitalWrite(pin, LOW);
}

void httpHandlePcPower() {
  if (!serverIsAuthorized()) {
    httpHandleNotFound();
    return;
  }

  pulseButton(PcPinPower);
  server.send_P(200, "text/plain", PcPowerOk, sizeof(PcPowerOk) - 1);
}

void httpHandlePcReset() {
  if (!serverIsAuthorized()) {
    httpHandleNotFound();
    return;
  }

  pulseButton(PcPinReset);
  server.send_P(200, "text/plain", PcResetOk, sizeof(PcResetOk) - 1);
}

#ifdef PRIVATE_ALLOW_CROSS
void serverSendHeadersForRaw() {
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Cache-Control", "no-store");
}
#endif

struct RawAllSender {
  COMPCONST size_t const lenBuffer = 1024;
  COMPCONST size_t const lenMax = lenBuffer - SensorRecord::lenBuffer;

  char buffer[lenBuffer];
  size_t len;
  size_t offset = 0;

  RawAllSender() {
    server.setContentLength(CONTENT_LENGTH_UNKNOWN);
#ifdef PRIVATE_ALLOW_CROSS
    serverSendHeadersForRaw();
#endif
    server.send(200, "text/plain", "", 0);
  }

  void sendRecord(uint64_t const unixOffset, SensorRecord const &record) {
    if (record.intoStr(unixOffset, buffer + offset, len)) {
      if ((offset += len) >= lenMax) {
        server.sendContent(buffer, offset);
        offset = 0;
      }
    }
  }

  void sendRingRecords(SensorRecord const *records, uint8_t const head, uint8_t const count) {
    uint64_t const unixOffset = ntpSyncer.unixOffset;
    uint8_t i;

    for (i = head; i < count; ++i) {
      sendRecord(unixOffset, records[i]);
    }
    for (i = 0; i < head; ++i) {
      sendRecord(unixOffset, records[i]);
    }
  }

  void sendPartialSlice(SensorSlice const &slice, uint16_t const count) {
    uint64_t const unixOffset = ntpSyncer.unixOffset;
    uint16_t i;

    for (i = 0; i < count; ++i) {
      sendRecord(unixOffset, slice.records[i]);
    }
  }

  void sendFullSlice(SensorSlice const &slice) {
    uint64_t const unixOffset = slice.unixOffset;
    uint16_t i;

    /* maybe this would use immediate number in instruction, so dont call sendPartialSlice lazily */
    for (i = 0; i < SensorSlice::MaxRecords; ++i) {
      sendRecord(unixOffset, slice.records[i]);
    }
  }

  void sendPage(uint16_t const pageID) {
    if (!history.fetchPage(pageID)) {
      return;
    }
    sendFullSlice(history.sliceL2);
  }

  void sendAll() {
    uint16_t i;

    if (history.countL2 > 0) {
      offset = history.firstPage();
      if (offset > 0) {
        for (i = offset; i < SensorHistory::FlashPageTotal; ++i) {
          sendPage(i);
        }
        offset = history.countL2 + offset - SensorHistory::FlashPageTotal;
        for (i = 0; i < offset; ++i) {
          sendPage(i);
        }
      } else {
        for (i = 0; i < history.countL2; ++i) {
          sendPage(i);
        }
      }
    }
    if (history.countL1 > 0) {
      sendPartialSlice(history.sliceL1, history.countL1);
    }
    if (history.countL0 > 0) {
      sendRingRecords(history.recordsL0, history.headL0, history.countL0);
    }

  }

  ~RawAllSender() {
    if (offset) {
      server.sendContent(buffer, offset);
    }
    server.sendContent("", 0);
  }
};

void httpHandleRawAll() {
  RawAllSender sender = {};

  sender.sendAll();
}

void httpHandleRawLast() {
  char buffer[SensorRecord::lenBuffer];
  size_t len;

  if (history.last().intoStr(ntpSyncer.unixOffset, buffer, len)) {
#ifdef PRIVATE_ALLOW_CROSS
    serverSendHeadersForRaw();
#endif
    server.send(200, "text/plain", buffer, len);
  }
}

void httpHandleRoot() {
  server.send_P(200, "text/html; charset=utf-8", RootPage, sizeof(RootPage) - 1);
}

void setup() {
  static String const wantedSSID = String(ConfigWiFiSSID);

  bool recoverFlash = false;
  int8_t countNetworks, bestScanID;
  uint8_t i, *currentBSSID;
  int32_t bestRSSI, currentRSSI, currentChannel;
  uint32_t millisCurrent;
  String currentSSID;

  pinMode(PcPinPower, OUTPUT);
  digitalWrite(PcPinPower, LOW);
  pinMode(PcPinReset, OUTPUT);
  digitalWrite(PcPinReset, LOW);

  Serial.begin(ConfigBaudRate);
  WiFi.setHostname(ConfigHostName);
  WiFi.setAutoReconnect(true);

  for (;;) {
    for (;;) {
      Serial.println("Scanning network...");
      countNetworks = WiFi.scanNetworks();
      if (countNetworks > 0) {
        Serial.printf("Discovered %" PRId8 " networks, filtering\n", countNetworks);
        break;
      }
      Serial.println("No network discovered, would rescan after 1 second");
      delay(OneSecondAsMs);
    }

    bestRSSI = INT32_MIN;
    bestScanID = -1;

    for (i = 0; i < countNetworks; ++i) {
      currentSSID = WiFi.SSID(i);
      currentRSSI = WiFi.RSSI(i);
      currentChannel = WiFi.channel(i);
      currentBSSID = WiFi.BSSID(i);
      Serial.printf(
        "[%02" PRId8 "] %-20s (%02" PRIx8 ":%02" PRIx8 ":%02" PRIx8 ":%02" PRIx8 ":%02" PRIx8 ":%02" PRIx8 ") %5" PRId32 " dBm @ ch %" PRId32 "\n",
        i, currentSSID.c_str(),
        currentBSSID[0], currentBSSID[1], currentBSSID[2],
        currentBSSID[3], currentBSSID[4], currentBSSID[5],
        currentRSSI, currentChannel
      );
      if (currentSSID != wantedSSID) {
        continue;
      }
      if (currentRSSI > bestRSSI) {
        if (bestRSSI == INT32_MIN) {
          Serial.println(" => FOUND");
        } else {
          Serial.println(" => REPLACE");
        }
        bestRSSI = currentRSSI;
        bestScanID = i;
      } else {
        Serial.println(" => BYPASS");
      }
    }
    if (bestRSSI == INT32_MIN || bestScanID == -1) {
      Serial.println("Did not find any matching network, would rescan after 1 second");
      WiFi.scanDelete();
      delay(OneSecondAsMs);
      continue;
    }
    Serial.printf("Chose %" PRId8 " as target AP\n", bestScanID);
    WiFi.begin(ConfigWiFiSSID, ConfigWiFiPassword, WiFi.channel(bestScanID), WiFi.BSSID(bestScanID));
    WiFi.scanDelete();

    if (!recoverFlash) {
      /* This might be slow so do it before waiting for online */
      history.recoverFlash();
      if (history.countL2 > 0) {
        Serial.printf("Recovered %" PRIu16 " slices from flash, head is %" PRIu16 "\n", history.countL2, history.headL2);
      }
      recoverFlash = true;
    }
    for (i = 0; i < MaxWaits; ++i) {
      if (WiFi.status() == WL_CONNECTED) {
        break;
      }
      delay(500);
    }
    if (i < MaxWaits) {
      Serial.print("WiFi IP: ");
      Serial.print(WiFi.localIP());
      Serial.print(" / ");
      Serial.print(WiFi.subnetMask());
      Serial.print(", Gateway: ");
      Serial.println(WiFi.gatewayIP());
      break;
    }
    Serial.println("Failed to connect, restart scanning process after 1 second");
    delay(OneSecondAsMs);
  }

  millisCurrent = millis();
  ntpSyncer.firstUpdate(millisCurrent);
  history.firstFetchAppend(millisCurrent);

  server.on("/", HTTP_GET, httpHandleRoot);
  server.on("/last", HTTP_GET, httpHandleLast);
  server.on("/pc/power", HTTP_POST, httpHandlePcPower);
  server.on("/pc/reset", HTTP_POST, httpHandlePcReset);
  server.on("/raw/last", HTTP_GET, httpHandleRawLast);
  server.on("/raw/all", HTTP_GET, httpHandleRawAll);
  server.onNotFound(httpHandleNotFound);
  server.begin();

  Serial.println("HTTP Server started");
}

void loop() {
  uint32_t millisCurrent;

  server.handleClient();
  millisCurrent = upTimer.currentMillis();
  ntpSyncer.maybeUpdate(millisCurrent);
  history.maybeFetchAppend(millisCurrent);
}
